app/views/trips/index.html.slim

    .row.row-cols-1.row-cols-md-2.row-cols-lg-3.g-4
      - @trips.each do |trip|
        .col
          .card.shadow-sm.h-100.trip-card
            .card-header.bg-white.border-bottom
---
SELECT "trips".* FROM "trips"