app/controllers/routes_controller.rb

  def create
    @route = @trip.routes.new(route_params)

    respond_to do |format|
      if @route.save
---
INSERT INTO "routes" ("waypoint_start_id", "waypoint_end_id", "segments", "geom", "created_at", "updated_at", "start_time", "trip_id", "profile", "surfaces") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def set_route
      @route = Route.find(params[:id])
---
SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]

    def set_trip
      @trip = Trip.find(params[:trip_id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]