app/controllers/routes_controller.rb

SELECT "route_sequences".* FROM "route_sequences" INNER JOIN "routes" ON "route_sequences"."route_id" = "routes"."id" WHERE "routes"."trip_id" = $1 ORDER BY "route_sequences"."sequence" ASC  [["trip_id", 1]]
---
  def index
    all_waypoints = @trip.waypoints.to_a

    @routes = @trip.route_sequences.order(:sequence).to_a

    route_ids = @routes.map(&:route_id)
    routes_by_id = Route.without_geom
                        .where(id: route_ids)
                        .preload(:waypoint_start, :waypoint_end)
                        .index_by(&:id)

    found_non_terminal = false
    @routes.each do |rs|

INSERT INTO "routes" ("waypoint_start_id", "waypoint_end_id", "segments", "geom", "created_at", "updated_at", "start_time", "trip_id", "profile", "surfaces") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @route = @trip.routes.build(route_params_with_duration)

    respond_to do |format|
      if @route.save

SELECT "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]
---
  def set_route
    @route = @trip.routes.find(params[:id])

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_trip
    @trip = Trip.find(params[:trip_id])

SELECT "route_sequences".* FROM "route_sequences" WHERE "route_sequences"."route_id" = $1 LIMIT $2  [["route_id", 86], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" INNER JOIN "routes" ON "trips"."id" = "routes"."trip_id" WHERE "routes"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]
---
  def set_route_for_show
    @route = @trip.routes.includes(
      :route_sequence, :waypoint_start, :waypoint_end, :trip
    ).find(params[:id])