app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
  def index
    @trips = Trip.all

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_trip
    @trip = Trip.find(params[:id])