app/controllers/waypoints_controller.rb

  def index
    @waypoints = @trip.waypoint_distances.order(:sequence).to_a

    waypoints = Waypoint
                .where(id: @waypoints.map(&:id))
                .to_a
---
SELECT "waypoint_distances".* FROM "waypoint_distances" WHERE "waypoint_distances"."trip_id" = $1 ORDER BY "waypoint_distances"."sequence" ASC  [["trip_id", 1]]
SELECT "waypoints".* FROM "waypoints" WHERE "waypoints"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55, $56, $57, $58, $59, $60, $61, $62, $63, $64, $65, $66, $67, $68, $69, $70, $71, $72, $73, $74, $75, $76, $77, $78, $79, $80, $81, $82, $83, $84, $85, $86, $87, $88, $89, $90, $91, $92, $93, $94, $95, $96, $97, $98, $99, $100, $101, $102, $103, $104, $105, $106, $107, $108, $109, $110, $111, $112, $113, $114, $115, $116, $117, $118, $119, $120, $121, $122, $123, $124, $125, $126, $127, $128, $129, $130, $131, $132, $133, $134, $135, $136, $137, $138, $139, $140, $141, $142, $143, $144, $145, $146, $147, $148, $149, $150, $151, $152, $153, $154, $155, $156, $157, $158, $159, $160, $161, $162, $163, $164, $165, $166, $167, $168, $169, $170, $171, $172, $173, $174, $175, $176, $177, $178, $179, $180, $181, $182, $183, $184, $185, $186, $187)

  def create
    @waypoint = Waypoint.new(waypoint_params.merge(trip: @trip))

    respond_to do |format|
      if @waypoint.save
---
INSERT INTO "waypoints" ("name", "address", "sequence", "lonlat", "created_at", "updated_at", "waypoint_type", "toll", "delay", "osm_poi_id", "trip_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    respond_to do |format|
      if @waypoint.update(waypoint_params.merge(trip: @trip))
---
UPDATE "waypoints" SET "name" = $1, "lonlat" = $2, "updated_at" = $3 WHERE "waypoints"."id" = $4  [["name", "Estancia Favo do Mel"], ["lonlat", "0020000001000010e600000000000000000000000000000000"], ["updated_at", "2025-09-15 11:44:04.790903"], ["id", 194]]

  def set_waypoint
    @waypoint = Waypoint.find(params[:id])
---
SELECT "waypoints".* FROM "waypoints" WHERE "waypoints"."id" = $1 LIMIT $2  [["id", 194], ["LIMIT", 1]]

  def set_trip
    @trip = Trip.find(params[:trip_id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]