app/views/routes/_form.html.slim

SELECT "waypoints".* FROM "waypoints" WHERE "waypoints"."trip_id" = $1 ORDER BY "waypoints"."sequence" ASC  [["trip_id", 1]]
---
    = form.label :waypoint_start_id, t('routes.form.waypoint_start'), class: 'form-label'
    = form.select :waypoint_start_id, options_for_select(@trip.waypoints.order(:sequence).map { |w| ["#{w.sequence} - #{w.name}", w.id] }, route.waypoint_start_id), { include_blank: false }, class: 'form-select'

SELECT "waypoints".* FROM "waypoints" WHERE "waypoints"."trip_id" = $1 ORDER BY "waypoints"."sequence" ASC  [["trip_id", 1]]
---
    = form.label :waypoint_end_id, t('routes.form.waypoint_end'), class: 'form-label'
    = form.select :waypoint_end_id, options_for_select(@trip.waypoints.order(:sequence).map { |w| ["#{w.sequence} - #{w.name}", w.id] }, route.waypoint_end_id), { include_blank: false }, class: 'form-select'